---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.SpotDimensionReferencesNoLongerHorizontal
source: html/b1f87b20-94d1-12c2-6e56-8ce22ecfffdf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.SpotDimensionReferencesNoLongerHorizontal Property

One or more Spot Dimension references are no longer valid. Spot Dimensions can generally reference
 only those references which have valid coordinates in the view.

## Syntax (C#)
```csharp
public static FailureDefinitionId SpotDimensionReferencesNoLongerHorizontal { get; }
```